//Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
//4 -> да
//-3 -> нет
//7 -> нет

//Считываем данные с консоли
Console.WriteLine("Введите число");
string? numberLine = Console.ReadLine();

// Проверяем, чтобы данные были не пустыми
if(numberLine != null)
{
      // Парсим введенные числа
    int number = int.Parse(numberLine);

    // Проверяем число на четность и нечетность
    if(number % 2 == 0)
    {
        // Выводим четное число в консоль
        Console.WriteLine("Число является четным");
    }
    else 
    {
        // Выводим нечетное число в консоль
        Console.WriteLine("Число является нечетным");
    }
}