// Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.
//5 -> 2, 4
//8 -> 2, 4, 6, 8

//Считываем данные с консоль
Console.WriteLine("Введите число");
string? numberLine = Console.ReadLine();

// Проверяем, чтобы данные были не пустыми
if( numberLine != null)
{
    //Парсим введенные числа
    int number = int.Parse(numberLine);

    // Перебираем все числа от 1 до N
    for(int i = 1; i <= number; i++)
    {
        
        // Проверяем на четность
        if(i % 2 == 0)
        {
            // Выводим данные в консоль
            Console.WriteLine(i);
        }

    }
}