// Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.
// 14212 -> нет
// 12821 -> да
// 23432 -> да

Console.WriteLine("Введите пятизначное число:");
string? number = Console.ReadLine(); //считываем данные с консоли
if(number != null) //проверяем, чтобы данные не были пустыми
 {
    if(number[0] == number[4] && number[1] == number[3]) //представляем строчку как массим, и сравниваем нужные цифры
    {
      Console.WriteLine("Число " + number + " является палиндромом");     
    }
    else
    {
      Console.WriteLine("Число " + number + " не является палиндромом");  
    }
 }
 